Revit 2024 API
FabricationService.ServiceId Property
 The service identifier of the service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int ServiceId { get; }
Visual Basic
Public ReadOnly Property ServiceId As Integer
	Get
Visual C++
public:
property int ServiceId {
	int get ();
}
See Also
FabricationService Class
Autodesk.Revit.DB Namespace